[
  {
    "id": 1,
    "position": "SDE Intern",
    "company": "Arcesium",
    "image": "https://i.imgur.com/qvrRDq0.png",
    "startDate": "May 2023",
    "endDate": "July 2023",
    "description": [
      "Implemented Hazelcast distributed cache management in a server‑side springboot application with over 40 tenants, effectively reducing API response time from 3‑digit ms to 2‑digit ms",
      "Streamlined and implemented a modular code structure that eliminated unnecessary database calls in a high‑traffic production application with 160 transactions per second."
    ],
    "skills": [
      "Java",
      "Springboot",
      "React.js",
      "Hazelcast"
    ]
  },
  {
    "id": 2,
    "position": "SDE Intern",
    "company": "STGI Technologies Pvt. Ltd.",
    "image": "https://i.imgur.com/pzdBLzT.png",
    "startDate": "December 2022",
    "endDate": "May 2023",
    "description": [
      "Led a team to deliver a document classification and validation software utilizing LayoutLmv3 classification, YOLO object detection, and SVM techniques, resulting in positive feedback from clients and reducing application processing time by 5 hours.",
      "Deployed and managed 2 ML solutions on AWS Cloud using services such as EC2, Sagemaker, Elastic Beanstalk, and storage options such as EFS, EBS, and S3",
      "Successfully created full‑stack applications using Vue.js, Vuetify, and FastAPI, while implementing unit testing for both front‑end and back‑end. Developed VSCode extensions and snippets to enhance development efficiency",
      "Migrated a Node.js application from LoopBack 3 to LoopBack 4, updating the codebase to incorporate the latest features and best practices of the framework while ensuring seamless functionality and performance."
    ],
    "skills": [
      "Vue.js",
      "Django",
      "FastApi",
      "AWS services"
    ]
  },
  {
    "id": 3,
    "position": "Frontend Intern",
    "company": "Foxmula - The Smart Way",
    "image": "https://i.imgur.com/X2fAGqx.png",
    "startDate": "June 2022",
    "endDate": "Nov 2022",
    "description": [
      "Reduced bugs by 25% and integrated frontend with backend in Worksickle project by migrating from HTML and JS to ReactJS.",
      "Independently developed Inversion project from scratch using Tailwind and MUI library.",
      "Resolved API request and payment process issues for Foxmula website with 1000+ users, ensuring uninterrupted service."
    ],
    "skills": [
      "React.js",
      "Tailwind CSS",
      "JavaScript"
    ]
  }
]